

execute as @p[team=] run tellraw @s [{"text":"嗝，欢迎欢迎，这里是一个多人生存复刻建筑房间，再强调一遍是建筑，红石其次，龙已经屠过了。接下来为你介绍房间和注意事项：", "color":"aqua"}]
execute as @p[team=] run tellraw @s [{"text":"本房间的初衷是建造且规划各种主题的建筑物【可以是学教程】，房间内的建筑均生存建造(除了某呆毛造的三样不是)。房内内有：原点党羽[金]，晨阳党羽[水蓝色]以及新人[白名]。短期生存党的出生点为坐标20万+格，体验原汁原味的生存。当然，短期的生存总是人少，孤独空虚寂寞冷是难免的（森导写的）常驻党的条件没有固定，因为要保障其他人的建筑和物资的安全，不白嫖不惹事是基本要求，在这之上就是能够接受生存模式，喜欢复刻建筑等条件。下述事项是你在本房间游玩前所需要了解的重要事项：", "color":"aqua"}]

execute as @p[team=] run tellraw @s [{"text":"0.请按下TAB,如果没有其它白名的人，“你们在哪”以及tp要求都不会有人理会，一直无能狂嚎的话只会被认为完全没看公告。", "color":"light_purple"}]
execute as @p[team=] run tellraw @s [{"text":"1.在出生点是处于冒险模式，离开出生点就是生存模式了。有死亡不掉落，目前是防爆状态，但是不代表之后不会关闭防爆。", "color":"light_purple"}]
execute as @p[team=] run tellraw @s [{"text":"2.房间内禁止辱骂攻击他人；禁止强迫别人PVP；盗取他人财产；破坏他人建筑。", "color":"light_purple"}]
execute as @p[team=] run tellraw @s [{"text":"3.适度白嫖", "color":"light_purple"}]
execute as @p[team=] run tellraw @s [{"text":"4.禁止无意义的跑图，更何况新人只能在距离出生点2000格范围内活动，放弃吧。", "color":"light_purple"}]
execute as @p[team=] run tellraw @s [{"text":"FINAL：本房间为24小时运行的联机房，房主只是一个主机，通常是不会回话的。想要参观但是没人的话可Q 群↓", "color":"light_purple"}]


execute as @p[team=] run tellraw @s [{"text":"————————————100-365-9343—————————————", "color":"gold"}]
execute as @p[team=] run tellraw @s [{"text":"看公告很重要，很重要，看懂公告是交流的前提，拒绝一进房间就要求tp的请求，没有tp没有创造权限。谢谢。", "color":"gold"}]
execute as @p[team=] run tellraw @s [{"text":"本房间会随wy版本升级时同时升级到1.16，且重置地狱存档。", "color":"gold"}]

# execute as @p[team=] run tellraw @s [{"text":"", "color":"blue"}]

# 嗝，欢迎欢迎，这里是一个多人生存复刻建筑房间，再强调一遍是建筑，红石其次，龙已经屠过了。接下来为你介绍房间和注意事项：
# 本房间的初衷是建造且规划各种主题的建筑物【可以是学教程】，房间内的建筑均生存建造(除了某呆毛造的三样不是)。
# 房内内有：原点党羽[金]，晨阳党羽[水蓝色]以及新人[白名]。
# 短期生存党的出生点为坐标20万+格，体验原汁原味的生存。当然，短期的生存总是人少，孤独空虚寂寞冷是难免的（森导写的）
# 常驻党的条件没有固定，因为要保障其他人的建筑和物资的安全，不白嫖不惹事是基本要求，在这之上就是能够接受生存模式，喜欢复刻建筑等条件。
# 下述事项是你在本房间游玩前所需要了解的重要事项：
# 0.请按下TAB,如果没有其它白名的人，“你们在哪”以及tp要求都不会有人理会，一直无能狂嚎的话只会被认为完全没看公告。
# 1.在出生点是处于冒险模式，离开出生点就是生存模式了。有死亡不掉落，目前是防爆状态，但是不代表之后不会关闭防爆。
# 2.房间内禁止辱骂攻击他人；禁止强迫别人PVP；盗取他人财产；破坏他人建筑。
# 3.适度白嫖
# 4.禁止无意义的跑图，更何况新人只能在距离出生点2000格范围内活动，放弃吧。
# FINAL：本房间为24小时运行的联机房，房主只是一个主机，通常是不会回话的。想要参观但是没人的话可以加抠群：1003659343
# —————————————————————————
# 看公告很重要，很重要，看懂公告是交流的前提，拒绝一进房间就要求tp的请求，没有tp没有创造权限。谢谢。
# 本房间会随wy版本升级时同时升级到1.16，且重置地狱存档。
