

execute as @p[team=] run tellraw @s [{"text":"嗝，欢迎欢迎，这里是网易minecraft多人生存复刻建筑房间，接下来为你介绍房间和规则", "color":"blue"}]
execute as @p[team=] run tellraw @s [{"text":"本房间的初衷是复刻大神的那些好看建筑并加以修改的休闲房间，房间内的建筑均生存建造(除了某呆毛造的四样不是)，龙已屠。房内分为参观客；常驻党[浅蓝名]，短期生存党[深蓝名]以及新人[白名]；拒绝一进房间就要求tp的请求，没有tp没有创造权限。短期生存党的出生点为坐标20万+格，体验原汁原味的生存，并且只能在距离出生点2000格范围内活动。当然，短期的生存总是人少，孤独空虚寂寞冷是难免的（森导写的）。常驻党的条件没有固定，因为要保障其他人的建筑和物资的安全，不白嫖不惹事是基本要求，在这之上就是能够接受生存模式，喜欢复刻建筑等条件。下面就是房间规则啦", "color":"blue"}]

execute as @p[team=] run tellraw @s [{"text":"0.请按下TAB,如果没有其它白名的人，就不要问蓝名“你们在哪”以及要求tp，这样我们只会认为你完全没看公告，不会有人理会你的。", "color":"red"}]
execute as @p[team=] run tellraw @s [{"text":"1.在出生点是处于冒险模式，离开出生点就是生存模式了。有死亡不掉落，目前是防爆状态，但是不代表之后不会关闭防爆。", "color":"red"}]
execute as @p[team=] run tellraw @s [{"text":"2.房间内禁止辱骂攻击他人，禁止强迫别人PVP", "color":"red"}]
execute as @p[team=] run tellraw @s [{"text":"3.房间里禁止盗取他人财产，破坏他人建筑，适度白嫖", "color":"red"}]
execute as @p[team=] run tellraw @s [{"text":"5.禁止无意义的跑图，存档会定期清理多余的区块", "color":"red"}]
execute as @p[team=] run tellraw @s [{"text":"FINAL：本房间为24小时运行的联机房，房主只是一个主机，通常是不会回话的。", "color":"red"}]
execute as @p[team=] run tellraw @s [{"text":"(你身上的东西不是你说有什么就有什么，房主说有什么就有什么，偷拿东西还装傻的人直接清空背包)", "color":"red"}]
execute as @p[team=] run tellraw @s [{"text":"阅读以上条规了之后就可以在服务器里快乐der玩了，如果你觉得看公告要花太多时间，我们也会认为回复你是浪费我们的时间", "color":"blue"}]


# execute as @p[team=] run tellraw @s [{"text":"", "color":"blue"}]

# 嗝，欢迎欢迎，这里是网易minecraft多人生存复刻建筑房间，接下来为你介绍房间和规则
# 本房间的初衷是复刻大神的那些好看建筑并加以修改的休闲房间，房间内的建筑均生存建造(除了某呆毛造的四样不是)，龙已屠。
# 房内分为参观客；常驻党[浅蓝名]，短期生存党[深蓝名]以及新人[白名]；拒绝一进房间就要求tp的请求，没有tp没有创造权限。
# 短期生存党的出生点为坐标20万+格，体验原汁原味的生存，并且只能在距离出生点2000格范围内活动。当然，短期的生存总是人少，孤独空虚寂寞冷是难免的（森导写的）
# 常驻党的条件没有固定，因为要保障其他人的建筑和物资的安全，不白嫖不惹事是基本要求，在这之上就是能够接受生存模式，喜欢复刻建筑等条件。
# 下面就是房间规则啦
# 0.请按下TAB,如果没有其它白名的人，就不要问蓝名“你们在哪”以及要求tp，这样我们只会认为你完全没看公告，不会有人理会你的。
# 1.在出生点是处于冒险模式，离开出生点就是生存模式了。有死亡不掉落，目前是防爆状态，但是不代表之后不会关闭防爆。
# 2.房间内禁止辱骂攻击他人，禁止强迫别人PVP
# 3.房间里禁止盗取他人财产，破坏他人建筑
# 4.适度白嫖
# 5.禁止无意义的跑图
# FINAL：本房间为24小时运行的联机房，房主只是一个主机，通常是不会回话的。
# (你身上的东西不是你说有什么就有什么，房主说有什么就有什么，偷拿东西还装傻的人直接清空背包)
# —————————————————————————
# 阅读以上条规了之后就可以在服务器里快乐der玩了：
